In [1]:
import pandas as pd
import numpy as np
import matplotlib as mlt
import seaborn as sns
#importing dataset
df=pd.read_csv('raw_messy_dataset.csv')
#handling empty cells using drop method
df

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
...,...,...,...,...,...,...,...
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [2]:
df.head(10)

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
5,Frank,unknown,Other,user5@example.com,NaN,70000,Admin
6,Grace,unknown,Female,user6@example.com,"July 4, 2020",80000,Engineering
7,Hannah,NaN,Other,user7@example.com,2021-05-21,NaN,HR
8,Ivy,30,Female,user8@example.com,NaN,50000,Engineering
9,Jack,35,Male,user9@example.com,2020/01/01,80000,Engineering

In [4]:
df.tail(10)

,Name,Age,Gender,Email,Join_Date,Salary,Department
95,Frank,NaN,Male,NaN,NaN,50000,NaN
96,Grace,40,Male,NaN,NaN,70000,Sales
97,Hannah,NaN,Male,NaN,2020/01/01,60000,NaN
98,Ivy,NaN,F,NaN,2020/01/01,50000,NaN
99,Jack,NaN,NaN,NaN,"July 4, 2020",60000,Admin
100,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
101,Bob,40,M,user1@example.com,NaN,50000,Engineering
102,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
103,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
104,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering

In [2]:
df.to_string()

'        Name      Age  Gender               Email     Join_Date   Salary   Department\n0      Alice      NaN     NaN   user0@example.com    2021-05-21      NaN        Admin\n1        Bob       40       M   user1@example.com           NaN    50000  Engineering\n2    Charlie  unknown    Male   user2@example.com    2020/01/01    50000           HR\n3      David      NaN     NaN   user3@example.com    2021-05-21    70000        Admin\n4        Eva       35   Other   user4@example.com  July 4, 2020    70000  Engineering\n5      Frank  unknown   Other   user5@example.com           NaN    70000        Admin\n6      Grace  unknown  Female   user6@example.com  July 4, 2020    80000  Engineering\n7     Hannah      NaN   Other   user7@example.com    2021-05-21      NaN           HR\n8        Ivy       30  Female   user8@example.com           NaN    50000  Engineering\n9       Jack       35    Male   user9@example.com    2020/01/01    80000  Engineering\n10     Alice      NaN       M  user10@example.com    2021-05-21    70000  Engineering\n11       Bob       35       M  user11@example.com  July 4, 2020    50000        Sales\n12   Charlie       35       M  user12@example.com    22-06-2022    80000        Sales\n13     David  unknown   Other  user13@example.com           NaN      NaN        Sales\n14       Eva       40    Male  user14@example.com  July 4, 2020    80000           HR\n15     Frank       35   Other  user15@example.com           NaN      NaN        Admin\n16     Grace      NaN   Other  user16@example.com    2021-05-21    70000          NaN\n17    Hannah  unknown    Male  user17@example.com           NaN      NaN  Engineering\n18       Ivy       30    Male  user18@example.com    2021-05-21    50000  Engineering\n19      Jack       40    Male  user19@example.com           NaN    70000           HR\n20     Alice      NaN    Male  user20@example.com    2021-05-21    50000  Engineering\n21       Bob      NaN       M  user21@example.com    22-06-2022  unknown        Sales\n22   Charlie       30       F  user22@example.com           NaN    60000          NaN\n23     David       40       F  user23@example.com           NaN      NaN    Marketing\n24       Eva  unknown    Male  user24@example.com           NaN    60000  Engineering\n25     Frank       25       F  user25@example.com    22-06-2022    60000        Sales\n26     Grace       40       F  user26@example.com  July 4, 2020      NaN    Marketing\n27    Hannah       30    Male  user27@example.com    2021-05-21    70000          NaN\n28       Ivy      NaN       F  user28@example.com    2020/01/01  unknown    Marketing\n29      Jack  unknown   Other  user29@example.com    2021-05-21    50000        Sales\n30     Alice       40  Female  user30@example.com    2021-05-21    80000        Admin\n31       Bob       25  Female  user31@example.com  July 4, 2020    50000        Admin\n32   Charlie       25    Male  user32@example.com    2021-05-21    80000    Marketing\n33     David       35       M  user33@example.com    22-06-2022    50000           HR\n34       Eva       35    Male  user34@example.com    22-06-2022      NaN    Marketing\n35     Frank      NaN       M  user35@example.com           NaN  unknown  Engineering\n36     Grace       30  Female  user36@example.com           NaN    80000  Engineering\n37    Hannah       40    Male  user37@example.com    2020/01/01      NaN        Admin\n38       Ivy       40     NaN  user38@example.com    2021-05-21    70000           HR\n39      Jack      NaN   Other  user39@example.com    2021-05-21    50000        Sales\n40     Alice      NaN       F  user40@example.com  July 4, 2020    50000  Engineering\n41       Bob      NaN       M  user41@example.com           NaN    80000        Admin\n42   Charlie      NaN     NaN  user42@example.com    22-06-2022    70000          NaN\n43     David      NaN       F  user43@example.com    2020/01/01    70000        Admin\n44       Eva       35       F  user44@example.com           NaN      NaN  Engineering\n45     Frank       40    Male  user45@example.com    22-06-2022      NaN  Engineering\n46     Grace      NaN       F  user46@example.com           NaN      NaN        Admin\n47    Hannah       40   Other  user47@example.com           NaN      NaN        Sales\n48       Ivy       25     NaN  user48@example.com  July 4, 2020      NaN    Marketing\n49      Jack       35       F  user49@example.com  July 4, 2020      NaN  Engineering\n50     Alice  unknown    Male  user50@example.com    2021-05-21      NaN        Admin\n51       Bob       35   Other  user51@example.com           NaN  unknown        Admin\n52   Charlie      NaN  Female  user52@example.com    2020/01/01    70000           HR\n53     David  unknown     NaN  user53@example.com           NaN      NaN    Marketing\n54       Eva       25       F  user54@example.com    22-06-2022    70000          NaN\n55     Frank      NaN    Male  user55@example.com           NaN    70000        Sales\n56     Grace       30  Female  user56@example.com           NaN    60000          NaN\n57    Hannah       40  Female  user57@example.com  July 4, 2020  unknown    Marketing\n58       Ivy       25       M  user58@example.com    2021-05-21      NaN    Marketing\n59      Jack       40   Other  user59@example.com    2021-05-21    50000    Marketing\n60     Alice      NaN       F  user60@example.com           NaN    80000          NaN\n61       Bob       30    Male  user61@example.com  July 4, 2020      NaN    Marketing\n62   Charlie       30       M  user62@example.com           NaN    50000        Admin\n63     David       25   Other  user63@example.com    2020/01/01  unknown          NaN\n64       Eva       30       M  user64@example.com  July 4, 2020    80000    Marketing\n65     Frank  unknown     NaN  user65@example.com           NaN  unknown        Admin\n66     Grace       30   Other  user66@example.com           NaN    70000           HR\n67    Hannah       40   Other  user67@example.com  July 4, 2020    80000    Marketing\n68       Ivy       40       F  user68@example.com           NaN    70000          NaN\n69      Jack      NaN   Other  user69@example.com  July 4, 2020    50000  Engineering\n70     Alice       40       M  user70@example.com    22-06-2022    50000    Marketing\n71       Bob      NaN   Other  user71@example.com  July 4, 2020    80000  Engineering\n72   Charlie       40       F  user72@example.com  July 4, 2020    80000        Admin\n73     David  unknown       F  user73@example.com           NaN      NaN           HR\n74       Eva      NaN     NaN  user74@example.com           NaN  unknown        Sales\n75     Frank       35       M  user75@example.com    2021-05-21      NaN           HR\n76     Grace      NaN  Female  user76@example.com    2021-05-21  unknown    Marketing\n77    Hannah       25  Female  user77@example.com    22-06-2022      NaN  Engineering\n78       Ivy       40   Other  user78@example.com    2021-05-21    70000  Engineering\n79      Jack       30     NaN  user79@example.com  July 4, 2020    80000          NaN\n80     Alice       40    Male  user80@example.com           NaN    50000  Engineering\n81       Bob       30   Other  user81@example.com    2021-05-21  unknown          NaN\n82   Charlie      NaN     NaN  user82@example.com    2021-05-21  unknown        Admin\n83     David      NaN       M  user83@example.com    22-06-2022    50000        Sales\n84       Eva      NaN       M  user84@example.com           NaN      NaN    Marketing\n85     Frank       30       M  user85@example.com    22-06-2022  unknown          NaN\n86     Grace       40       M  user86@example.com  July 4, 2020      NaN        Sales\n87    Hannah      NaN       M  user87@example.com           NaN    70000  Engineering\n88       Ivy  unknown     NaN  user88@example.com    22-06-2022    80000  Engineering\n89      Jack      NaN     NaN  user89@example.com    2021-05-21    50000        Sales\n90     Alice       30       F                 NaN           NaN    80000  Engineering\n91       Bob       30  Female                 NaN           NaN      NaN        Admin\n92   Charlie       40       M                 NaN    2021-05-21  unknown        Admin\n93     David       30    Male                 NaN    22-06-2022  unknown        Sales\n94       Eva       30     NaN                 NaN    2021-05-21      NaN          NaN\n95     Frank      NaN    Male                 NaN           NaN    50000          NaN\n96     Grace       40    Male                 NaN           NaN    70000        Sales\n97    Hannah      NaN    Male                 NaN    2020/01/01    60000          NaN\n98       Ivy      NaN       F                 NaN    2020/01/01    50000          NaN\n99      Jack      NaN     NaN                 NaN  July 4, 2020    60000        Admin\n100    Alice      NaN     NaN   user0@example.com    2021-05-21      NaN        Admin\n101      Bob       40       M   user1@example.com           NaN    50000  Engineering\n102  Charlie  unknown    Male   user2@example.com    2020/01/01    50000           HR\n103    David      NaN     NaN   user3@example.com    2021-05-21    70000        Admin\n104      Eva       35   Other   user4@example.com  July 4, 2020    70000  Engineering'

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         72 non-null     object
 2   Gender      89 non-null     object
 3   Email       95 non-null     object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: object(7)
memory usage: 5.9+ KB

In [ ]:
#age should be int it can't be object 
#there is incorrect format of data is available
#Date should be in the date format
#salary should be in integer type

In [7]:
#SEARCHING FOR DUPLICATES
df.duplicated().sum() #count of duplicate values

5

In [10]:
#removing duplicates
df.drop_duplicates(inplace=True)

In [11]:
df.duplicated().sum()

0

In [13]:
#columns
df.columns

Index(['Name', 'Age', 'Gender', 'Email', 'Join_Date', 'Salary', 'Department'], dtype='object')

In [16]:
#handling age 
df["Age"]=pd.to_numeric(df["Age"],errors='coerce')

In [20]:
x=df["Age"].median()
x
df["Age"]=pd.to_numeric(df["Age"],errors="coerce")

In [22]:
x=df["Age"].median()
df["Age"].fillna(x,inplace=True)

C:\Users\swaro\AppData\Local\Temp\ipykernel_2520\2053316563.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(x,inplace=True)

In [24]:
df["Age"].unique()

array([35., 40., 30., 25.])

In [26]:
#handling gender column
df["Gender"].unique()

array([nan, 'M', 'Male', 'Other', 'Female', 'F'], dtype=object)

In [28]:
#replacing values using replace function
df["Gender"]=df["Gender"].replace({"M":"Male","F":"Female","":"None"})         #Replacing 'M' to 'Male' & 'F' to 'Female'

In [34]:
#filling the blank places in email column
df["Email"].fillna("Null",inplace=True)

In [35]:
print(df.to_string)

<bound method DataFrame.to_string of        Name   Age  Gender              Email     Join_Date Salary   Department
0     Alice  35.0     NaN  user0@example.com    2021-05-21    NaN        Admin
1       Bob  40.0    Male  user1@example.com           NaN  50000  Engineering
2   Charlie  35.0    Male  user2@example.com    2020/01/01  50000           HR
3     David  35.0     NaN  user3@example.com    2021-05-21  70000        Admin
4       Eva  35.0   Other  user4@example.com  July 4, 2020  70000  Engineering
..      ...   ...     ...                ...           ...    ...          ...
95    Frank  35.0    Male                  -           NaN  50000          NaN
96    Grace  40.0    Male                  -           NaN  70000        Sales
97   Hannah  35.0    Male                  -    2020/01/01  60000          NaN
98      Ivy  35.0  Female                  -    2020/01/01  50000          NaN
99     Jack  35.0     NaN                  -  July 4, 2020  60000        Admin

[100 rows x 7 columns]>

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   66 non-null     object
 5   Salary      74 non-null     object
 6   Department  84 non-null     object
dtypes: float64(1), object(6)
memory usage: 6.2+ KB

In [40]:
#handling date_time column
df["Join_Date"]=pd.to_datetime(df["Join_Date"],errors="coerce")

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      74 non-null     object
 6   Department  84 non-null     object
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 6.2+ KB

In [44]:
df["Salary"]=pd.to_numeric(df["Salary"],errors="coerce")

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         100 non-null    float64
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      60 non-null     float64
 6   Department  84 non-null     object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 6.2+ KB

In [46]:
df["Department"].unique()

array(['Admin', 'Engineering', 'HR', 'Sales', nan, 'Marketing'],
      dtype=object)

In [50]:
#Handling missing values of department column
z=df["Department"].mode()[0]
z

'Engineering'

In [49]:
df["Department"].fillna(z,inplace=True)

C:\Users\swaro\AppData\Local\Temp\ipykernel_2520\2382338656.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Department"].fillna(z,inplace=True)

In [53]:
#save data into new file
df.to_csv("cleaned_data_file.csv")